# specify a directory to install
cask_args appdir: "/Applications"

tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "homebrew/cask-fonts"

# fonts
cask "font-fira-code"
cask "font-hack-nerd-font"

# shell tools
brew "coreutils"
brew "checkbashisms"
brew "gnupg"
brew "tldr"
brew "wget"
brew "pandoc"
brew "help2man"
brew "shellcheck"
brew "netcat"
brew "nmap"
brew "dnsmasq", restart_service: true
brew "dos2unix"
brew "telnet"


# programming
brew "composer"
brew "node"
brew "php", restart_service: true
brew "git"
brew "git-lfs"
brew "kubernetes-cli"
brew "mariadb", link: false
brew "mysql", restart_service: true

# other
brew "hugo"
brew "ffmpeg"

# Mac App Store
mas "Amphetamine", id: 937984704
mas "Slack", id: 803453959
mas "Trello", id: 1278508951
mas "Xcode", id: 497799835
mas "Sequel Ace", id: 1518036000
mas "JSONPeep", id: 1458969831
mas "Kindle", id: 405399194
mas "Mactracker", id: 430255202
mas "Pages", id: 409201541
mas "Paprika Recipe Manager", id: 451907568
mas "Raindrop.io for Safari", id: 957810159

# Work
brew "azure-cli"
mas "Microsoft Excel", id: 462058435
mas "Microsoft Outlook", id: 985367838
mas "Microsoft Remote Desktop", id: 1295203466
mas "Microsoft Word", id: 462054704
mas "MSG Viewer for Outlook", id: 973213640
mas "OneDrive", id: 823766827
cask "xquartz"
